//Задача 1. Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.
/*
int TwoNumber(int num)
{
    int des = num / 10;
        
    int result = des % 10;
    return result;
}

Console.WriteLine("Введиде трехзначное число: ");
int number = Convert.ToInt32(Console.ReadLine());
int newNum = TwoNumber(number);

Console.WriteLine($"Ввели число {number}, получили новое число {newNum}");
*/


